{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "Acoso callejero",
    "1": "Amenazas",
    "2": "Consumo de drogas en espacio p\u00fablico",
    "3": "Da\u00f1os a la propiedad",
    "4": "Hurto",
    "5": "Portonazo",
    "6": "Robo con violencia",
    "7": "Robo por sorpresa",
    "8": "Tr\u00e1fico de drogas",
    "9": "Violencia intrafamiliar"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Acoso callejero": 0,
    "Amenazas": 1,
    "Consumo de drogas en espacio p\u00fablico": 2,
    "Da\u00f1os a la propiedad": 3,
    "Hurto": 4,
    "Portonazo": 5,
    "Robo con violencia": 6,
    "Robo por sorpresa": 7,
    "Tr\u00e1fico de drogas": 8,
    "Violencia intrafamiliar": 9
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 119547
}
